In [11]:
import pandas as pd
import numpy as np

## MEMBACA DARI CSV

In [66]:
df = pd.read_csv('dataABC.csv', delimiter=';', skiprows=2, skipfooter=2)
df

c:\users\nadian\anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

   No  Nama  Usia       Kota      Gaji
0   1  Andi    23    Jakarta  12000000
1   2  Budi    15   Semarang   9000000
2   3  Caca    24   Surabaya  12000000
3   4  Deni    45       Solo  10000000
4   5  Euis    23  Tangerang  14000000
5   6  Fafa    20  Tangerang  10000000

In [67]:
# df = df.set_index('No')
df
# menampilkan gaji maksimum
df.Gaji.max()

14000000

In [25]:
df.Gaji.min()

9000000

In [30]:
# MENAMPILKAN DATA ROW yang gajinya minimal

df[df['Gaji'] == df.Gaji.min()]
# df['Gaji'] == df.Gaji.min()

    Nama  Usia      Kota     Gaji
No
2   Budi    15  Semarang  9000000

In [33]:
# MENAMPILKAN DATA ROWS yang gajinya == 12000000

df[df['Gaji'] == 12000000]

# df['Gaji'] == 12000000

    Nama  Usia      Kota      Gaji
No
1   Andi    23   Jakarta  12000000
3   Caca    24  Surabaya  12000000

In [34]:
df[df.Usia == df.Usia.max()]

    Nama  Usia  Kota      Gaji
No
4   Deni    45  Solo  10000000

In [51]:
df[df.Usia > 22]

    Nama  Usia       Kota      Gaji
No
1   Andi    23    Jakarta  12000000
3   Caca    24   Surabaya  12000000
4   Deni    45       Solo  10000000
5   Euis    23  Tangerang  14000000

In [47]:
df[df.Usia >22][df.Kota == 'Jakarta']

c:\users\nadian\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

    Nama  Usia     Kota      Gaji
No
1   Andi    23  Jakarta  12000000

In [52]:
df[(df.Usia>22) & (df.Kota != 'Jakarta')]

    Nama  Usia       Kota      Gaji
No
3   Caca    24   Surabaya  12000000
4   Deni    45       Solo  10000000
5   Euis    23  Tangerang  14000000

In [74]:
# from pprint import pprint
kota  = list(df.groupby(by = 'Kota'))
# pprint(kota)
for i in kota:
    print(i[0])

Jakarta
Semarang
Solo
Surabaya
Tangerang

## Membaca dari Excel

In [79]:
df = pd.read_excel('dataABC.xlsx', skiprows=3, skip_footer=3)
df = pd.
df

   No  Nama  Usia       Kota      Gaji
0   1  Andi    23    Jakarta  12000000
1   2  Budi    15   Semarang   9000000
2   3  Caca    24   Surabaya  12000000
3   4  Deni    45       Solo  10000000
4   5  Euis    23  Tangerang  14000000

In [82]:
#menampilkan dataframe dengan urutan KOLOM DIREVERSE

df[['Gaji', 'Kota', 'Usia', 'Nama', 'No']]

       Gaji       Kota  Usia  Nama  No
0  12000000    Jakarta    23  Andi   1
1   9000000   Semarang    15  Budi   2
2  12000000   Surabaya    24  Caca   3
3  10000000       Solo    45  Deni   4
4  14000000  Tangerang    23  Euis   5

In [88]:
reverseCol = df.columns.tolist()[::-1]
print(reverseCol)
df[reverseCol]

['Gaji', 'Kota', 'Usia', 'Nama', 'No']

       Gaji       Kota  Usia  Nama  No
0  12000000    Jakarta    23  Andi   1
1   9000000   Semarang    15  Budi   2
2  12000000   Surabaya    24  Caca   3
3  10000000       Solo    45  Deni   4
4  14000000  Tangerang    23  Euis   5

In [95]:
# MEMANIPULASI urutan KOLOM

kol = df.columns.tolist()
kol = kol[-1:] + kol[:-1]
kol
df[kol]

       Gaji  No  Nama  Usia       Kota
0  12000000   1  Andi    23    Jakarta
1   9000000   2  Budi    15   Semarang
2  12000000   3  Caca    24   Surabaya
3  10000000   4  Deni    45       Solo
4  14000000   5  Euis    23  Tangerang